13/data/attachments/305a4f6f1dd2f10.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_76ffa7ac-e1c7-4c72-9987-bf5304e710e8</nif:username>
            <nif:friendToBeAdded>Brittany_Mrs_Friend_94697_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>